all_signs = ['А', 'Е', 'Ё', 'И', 'Й', 'О', 'У', 'Ы', 'Э', 'Ю', 'Я', 
           'а', 'е', 'ё', 'и', 'й', 'о', 'у', 'ы', 'э', 'ю', 'я', 
           '.', ',', '!', '?', ';', ':', '-', '—', '"', "'", '(', ')', 
           '[', ']', '{', '}', '<', '>', '/', '\\', '|', '+', '=']

def translate(text):
    translated_text = ''
    new_text = list(text)
    for i in new_text:
        if (i not in all_signs):
            translated_text += i   
    print(translated_text)
    
translate("Удивительный факт, но текст на языке НЕРАЗБОРЧИВО оказывается довольно просто читать. Достаточно небольшой тренировки - и вы сможете это делать.")