def number_to_words(n):
    ones = ['ноль', 'один', 'два', 'три', 'четыре', 'пять', 'шесть', 'семь', 'восемь', 'девять', 'десять',
            'одиннадцать', 'двенадцать', 'тринадцать', 'четырнадцать', 'пятнадцать', 'шестнадцать',
            'семнадцать', 'восемнадцать', 'девятнадцать']
    tens = ['', '', 'двадцать', 'тридцать', 'сорок', 'пятьдесят', 'шестьдесят', 'семьдесят', 'восемьдесят', 'девяносто']
    if 0 <= n <= 19:
        return ones[n]
    else:
        tens_digit = n // 10
        ones_digit = n % 10
        words = tens[tens_digit] + ' ' + ones[ones_digit]
        return words
    
print(number_to_words(4))

print(number_to_words(13))